In [2]:
# Dataframes
import pandas as pd
data = pd.DataFrame({
    "Name":['Anna','Ben'],
    'Lemonade' : [2,3]
})

print(data) # keys are the columns

   Name  Lemonade
0  Anna         2
1   Ben         3

In [2]:
import pandas as pd
s1 = pd.Series(data=[1,2,3,4,5])
s2 = pd.Series(data=[10,20,30,40,50])
si = pd.Series(data=[100,200,300,400,500],index=list('abcde'))

data = pd.DataFrame({'c1':s1,'c2':s2})
data

   c1  c2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50

In [ ]:
print(s1.shape)
print(data.shape) #(rows , columns)

(5,)
(5, 2)

In [6]:
data.columns

Index(['c1', 'c2'], dtype='object')

In [ ]:
data.dtypes #shows you the data types of each columns

c1    int64
c2    int64
dtype: object

In [8]:
# accessing the data

# data.loc : by use of the labels
# and iloc will use the index

data.loc[0]

c1     1
c2    10
Name: 0, dtype: int64

In [9]:
data.iloc[0]

c1     1
c2    10
Name: 0, dtype: int64

In [ ]:
# data.loc[rownumber,column_label]
# data.loc[rownumber,column_index]

print(data.loc[1,'c1'])
print(data.iloc[1,0])

# both are same

2
2

In [ ]:
#methods of Dataframe
data.count() #number of objects inside the dataframe

c1    5
c2    5
dtype: int64

In [ ]:
data.info() #summary view

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   c1      5 non-null      int64
 1   c2      5 non-null      int64
dtypes: int64(2)
memory usage: 212.0 bytes

In [13]:
data.describe()

             c1         c2
count  5.000000   5.000000
mean   3.000000  30.000000
std    1.581139  15.811388
min    1.000000  10.000000
25%    2.000000  20.000000
50%    3.000000  30.000000
75%    4.000000  40.000000
max    5.000000  50.000000

In [ ]:
data.sort_values #data was actually already sorted.

<bound method DataFrame.sort_values of    c1  c2
0   1  10
1   2  20
2   3  30
3   4  40
4   5  50>

In [19]:
# tell me that : a data intem inside the data dataframe has a value grater than 2

data[data['c1']!=2]

   c1  c2
0   1  10
2   3  30
3   4  40
4   5  50

In [25]:
data['Tips'] = [1,2,3,4,5]
data.describe()

             c1         c2      Tips
count  5.000000   5.000000  5.000000
mean   3.000000  30.000000  3.000000
std    1.581139  15.811388  1.581139
min    1.000000  10.000000  1.000000
25%    2.000000  20.000000  2.000000
50%    3.000000  30.000000  3.000000
75%    4.000000  40.000000  4.000000
max    5.000000  50.000000  5.000000

In [23]:
# delete the tips
del data['Tips']

In [26]:
# alternative to delete is:
data =data.drop(columns=['Tips'])

In [27]:
# find the value 2 and set it as 10

data.loc[data['c1']==2] = 10

In [32]:
# rename the columns

data.rename(columns={'c1':'columns1'}) #only for the sake to show you the output
data.rename(columns={'c1':'columns1'},inplace=True) #to make it permanenet

data

   columns1  c2
0         1  10
1        10  10
2         3  30
3         4  40
4         5  50

In [35]:
# indexing and selection

data.set_index('columns1',inplace=True)

In [36]:
data

          c2
columns1
1         10
10        10
3         30
4         40
5         50

In [37]:
data.loc[10,'c2']

np.int64(10)

In [45]:
data['Tips']=['A','B','C','D','E']
data

          c2 Tips
columns1
1         10    A
10        10    B
3         30    C
4         40    D
5         50    E

In [48]:
data.reset_index(inplace=True)

In [49]:
data

   columns1  c2 Tips
0         1  10    A
1        10  10    B
2         3  30    C
3         4  40    D
4         5  50    E

In [50]:
data.set_index("Tips",inplace=True)

In [52]:
data

      columns1  c2
Tips
A            1  10
B           10  10
C            3  30
D            4  40
E            5  50

In [54]:
data.loc['B','c2']
data.iloc[0,1]

np.int64(10)

In [55]:
# multiindex

multi_data = pd.DataFrame({
    'Park':['A','A','B','B'],
    'Name' : ['Anna','Ben','Chris','Daisy'],
    'Lemonades':[2,3,4,5]
}).set_index(['Park','Name'])

In [56]:
multi_data

            Lemonades
Park Name
A    Anna           2
     Ben            3
B    Chris          4
     Daisy          5

In [58]:
# find the rows where the lemonades numbers is greater than 3

multi_data[multi_data['Lemonades']>=3]

            Lemonades
Park Name
A    Ben            3
B    Chris          4
     Daisy          5

In [59]:
# using the query where you will mention the name of the colun and give the condition

multi_data.query('Lemonades>3')

            Lemonades
Park Name
B    Chris          4
     Daisy          5